#基础运算
加减乘除

1+1 ; 1-1 ; 1*1 ; 1/1 ; 1/0

-1/0
1/-0
-1/-0

(1+1)/2

10 %% 3 ; 9 %% 3
10 %/% 3 ; 10 %/% 3

乘方对数
2^3 ; log(8,2) ; log2(8) ; 
10^2 ; log(100,10) ; log10(100)
3^2 ; log(9,3)


v1 <- c(1,2,3,4,5)

sum(v1) ; mean(v1) ; var(v1) ; sd(v1)


df2 <- data.frame(C1=c(1,2,3,4,5),C2 = c(5,6,7,8,9),C=c(10,11,12,13,14))
colSums(df2)
colMeans(df2)
rowSums(df2)
rowMeans(df2)


#逻辑判断
1 > 2 ; 2 > 1

1 >= 2 ; 1 <= 2

1 == 2 ; 1 != 2

1 > 2 | 2 > 1 ; FALSE | TRUE
1 > 2 & 2 > 1 ; FALSE & TRUE

! 1 > 2 ; ! FALSE

!1 ; !0 ; 1 == TRUE ; 0 == FALSE


v2 <- c(1,2,3,4,5)

2 %in% v2 ; 3 %in% v2 ; 6 %in% v2




